app/views/pages/data.js.erb

var neighborhoods_by_id = {};
$.each(neighborhoods, function(index, value){
  var n = value.neighborhood;
  neighborhoods_by_id[n.id] = n;
});
---
SELECT "neighborhoods".* FROM "neighborhoods"