app/views/pages/home.html.erb

      <% @neighborhoods.each do |n| %>
        <% unless n.spots.empty? %>
---
SELECT COUNT(*) AS count_id FROM "spots" INNER JOIN "addresses" ON "spots".id = "addresses".spot_id WHERE (("addresses".neighborhood_id = 3))