app/controllers/pages_controller.rb

SELECT "neighborhoods".* FROM "neighborhoods" ORDER BY name
---
  def home
    @neighborhoods = Neighborhood.order('name')

SELECT "neighborhoods".* FROM "neighborhoods"
---
  def data
    @neighborhoods = Neighborhood.all